In [18]:
import pandas as pd
data = pd.read_csv('titanic.csv')
data.columns[5]

'Age'

In [22]:
data.head
data.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [51]:
data.at[5, 'Age'] = 28.0
data.to_csv('titanic.csv', index=False)
data.loc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                        28.0
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [49]:
print(data.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age             object
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [50]:
data['Age'] = pd.to_numeric(data['Age'], errors='coerce')
filtered = data[data['Age'] > 18 ]
count = len(filtered)
print(count)

579

In [80]:
''' x = 0
for person in data["Sex"]:
    if person == "male":
        count = count + 1
            
counts = (count / len(data)) * 100
counts
'''

'''filtered_sex = data[data['Sex'] == "male" ]
count_sex = len(filtered_sex)
print(count_sex)
y = (count_sex / len(data)) * 100
print(y)
'''

'''
f_s = data[data['Sex'] == "male"], data.shape() / len(data) * 100

not working, unsure why
'''

TypeError: 'tuple' object is not callable

In [86]:
import pandas as pd
info = pd.read_csv('ship.csv')
info.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [101]:
Classes = info['Pclass'].value_counts()
freqTable = pd.DataFrame(Classes)
y = freqTable["percent"] = (Classes / len(info))*100
print(y)is

3    55.106622
1    24.242424
2    20.650954
Name: Pclass, dtype: float64